[Killed] BlockStatement
src/services/auth.service.ts:7:87
 import { generateToken } from '../utils/jwt.util';
 
 class AuthService {
-  async register(data: CreateUserDto): Promise<{ user: UserResponse; token: string }> {
-    const existingUser = await userRepository.findByEmail(data.email);
-    if (existingUser !== null) {
-      throw new Error('User with this email already exists');
-    }
-
-    const hashedPassword = await hashPassword(data.password);
-    const user = await userRepository.create({
-      ...data,
-      password: hashedPassword,
-    });
-
-    const token = generateToken({ userId: user.id, email: user.email });
-
-    const userResponse: UserResponse = {
-      id: user.id,
-      email: user.email,
-      name: user.name,
-      timezone: user.timezone,
-      createdAt: user.createdAt,
-      updatedAt: user.updatedAt,
-    };
-
-    return { user: userResponse, token };
-  }
+  async register(data: CreateUserDto): Promise<{ user: UserResponse; token: string }> {}
 
   async login(email: string, password: string): Promise<{ user: UserResponse; token: string }> {
killedBy: Habits E2E Tests Complete Habit Workflow should create a new habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 401

[Killed] ConditionalExpression
src/services/auth.service.ts:9:9
 class AuthService {
   async register(data: CreateUserDto): Promise<{ user: UserResponse; token: string }> {
     const existingUser = await userRepository.findByEmail(data.email);
-    if (existingUser !== null) {
+    if (true) {
       throw new Error('User with this email already exists');
     }
killedBy: Habits E2E Tests Complete Habit Workflow should create a new habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 401

[Killed] BlockStatement
src/services/auth.service.ts:9:32
 class AuthService {
   async register(data: CreateUserDto): Promise<{ user: UserResponse; token: string }> {
     const existingUser = await userRepository.findByEmail(data.email);
-    if (existingUser !== null) {
-      throw new Error('User with this email already exists');
-    }
+    if (existingUser !== null) {}
 
     const hashedPassword = await hashPassword(data.password);
killedBy: Auth Integration Tests POST /api/auth/register should return 400 for duplicate email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ObjectLiteral
src/services/auth.service.ts:21:40
 
     const token = generateToken({ userId: user.id, email: user.email });
 
-    const userResponse: UserResponse = {
-      id: user.id,
-      email: user.email,
-      name: user.name,
-      timezone: user.timezone,
-      createdAt: user.createdAt,
-      updatedAt: user.updatedAt,
-    };
+    const userResponse: UserResponse = {};
 
     return { user: userResponse, token };
killedBy: Habits E2E Tests Complete Habit Workflow should create a new habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 401

[Killed] BlockStatement
src/services/auth.service.ts:33:96
     return { user: userResponse, token };
   }
 
-  async login(email: string, password: string): Promise<{ user: UserResponse; token: string }> {
-    const user = await userRepository.findByEmail(email);
-    if (user === null) {
-      throw new Error('Invalid credentials');
-    }
-
-    const isPasswordValid = await comparePassword(password, user.password);
-    if (!isPasswordValid) {
-      throw new Error('Invalid credentials');
-    }
-
-    const token = generateToken({ userId: user.id, email: user.email });
-
-    const userResponse: UserResponse = {
-      id: user.id,
-      email: user.email,
-      name: user.name,
-      timezone: user.timezone,
-      createdAt: user.createdAt,
-      updatedAt: user.updatedAt,
-    };
-
-    return { user: userResponse, token };
-  }
+  async login(email: string, password: string): Promise<{ user: UserResponse; token: string }> {}
 }
 
killedBy: Auth Integration Tests POST /api/auth/login should login existing user
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[Killed] ConditionalExpression
src/services/auth.service.ts:35:9
 
   async login(email: string, password: string): Promise<{ user: UserResponse; token: string }> {
     const user = await userRepository.findByEmail(email);
-    if (user === null) {
+    if (true) {
       throw new Error('Invalid credentials');
     }
killedBy: Auth Integration Tests POST /api/auth/login should login existing user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] EqualityOperator
src/services/auth.service.ts:35:9
 
   async login(email: string, password: string): Promise<{ user: UserResponse; token: string }> {
     const user = await userRepository.findByEmail(email);
-    if (user === null) {
+    if (user !== null) {
       throw new Error('Invalid credentials');
     }
killedBy: Auth Integration Tests POST /api/auth/login should login existing user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/services/auth.service.ts:40:9
     }
 
     const isPasswordValid = await comparePassword(password, user.password);
-    if (!isPasswordValid) {
+    if (true) {
       throw new Error('Invalid credentials');
     }
killedBy: Auth Integration Tests POST /api/auth/login should login existing user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BooleanLiteral
src/services/auth.service.ts:40:9
     }
 
     const isPasswordValid = await comparePassword(password, user.password);
-    if (!isPasswordValid) {
+    if (isPasswordValid) {
       throw new Error('Invalid credentials');
     }
killedBy: Auth Integration Tests POST /api/auth/login should login existing user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401
