[Killed] BlockStatement
src/services/habit.service.ts:6:50
 import { CreateHabitDto, UpdateHabitDto, Habit } from '../models/habit.model';
 
 class HabitService {
-  async getAll(userId: string): Promise<Habit[]> {
-    return habitRepository.findByUserId(userId);
-  }
+  async getAll(userId: string): Promise<Habit[]> {}
 
   async getById(id: string, userId: string): Promise<Habit> {
killedBy: Habits E2E Tests Complete Habit Workflow should get all user habits
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received string: ""

[Killed] BlockStatement
src/services/habit.service.ts:10:61
     return habitRepository.findByUserId(userId);
   }
 
-  async getById(id: string, userId: string): Promise<Habit> {
-    const habit = await habitRepository.findById(id);
-    if (habit === null) {
-      throw new Error('Habit not found');
-    }
-    if (habit.userId !== userId) {
-      throw new Error('Access denied');
-    }
-    return habit;
-  }
+  async getById(id: string, userId: string): Promise<Habit> {}
 
   async create(userId: string, data: CreateHabitDto): Promise<Habit> {
killedBy: Habits E2E Tests Complete Habit Workflow should update habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] EqualityOperator
src/services/habit.service.ts:12:9
 
   async getById(id: string, userId: string): Promise<Habit> {
     const habit = await habitRepository.findById(id);
-    if (habit === null) {
+    if (habit !== null) {
       throw new Error('Habit not found');
     }
killedBy: Habits E2E Tests Complete Habit Workflow should get habit by id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/services/habit.service.ts:12:9
 
   async getById(id: string, userId: string): Promise<Habit> {
     const habit = await habitRepository.findById(id);
-    if (habit === null) {
+    if (false) {
       throw new Error('Habit not found');
     }
killedBy: Habits E2E Tests Complete Habit Workflow should get habit by id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] StringLiteral
src/services/habit.service.ts:13:23
   async getById(id: string, userId: string): Promise<Habit> {
     const habit = await habitRepository.findById(id);
     if (habit === null) {
-      throw new Error('Habit not found');
+      throw new Error("");
     }
     if (habit.userId !== userId) {
killedBy: Habits E2E Tests Complete Habit Workflow should return 404 for deleted habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 401

[Killed] EqualityOperator
src/services/habit.service.ts:15:9
     if (habit === null) {
       throw new Error('Habit not found');
     }
-    if (habit.userId !== userId) {
+    if (habit.userId === userId) {
       throw new Error('Access denied');
     }
killedBy: Habits E2E Tests Complete Habit Workflow should get habit by id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BlockStatement
src/services/habit.service.ts:15:34
     if (habit === null) {
       throw new Error('Habit not found');
     }
-    if (habit.userId !== userId) {
-      throw new Error('Access denied');
-    }
+    if (habit.userId !== userId) {}
     return habit;
   }
killedBy: HabitService getById should throw error if user does not own habit
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"categoryId": "category-id", "createdAt": 2025-12-01T22:06:52.837Z, "description": "Run 5km", "frequency": "daily", "id": "habit-id", "isActive": true, "targetDays": null, "title": "Morning Run", "updatedAt": 2025-12-01T22:06:52.837Z, "userId": "other-user"}

[Killed] StringLiteral
src/services/habit.service.ts:16:23
       throw new Error('Habit not found');
     }
     if (habit.userId !== userId) {
-      throw new Error('Access denied');
+      throw new Error("");
     }
     return habit;
killedBy: HabitService getById should throw error if user does not own habit
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Access denied"
Received message:   ""

      77 |         } else {
      78 |           stryCov_9fa48("41");
    > 79 |           throw new Error(stryMutAct_9fa48("42") ? "" : (stryCov_9fa48("42"), 'Access denied'));

[Killed] BlockStatement
src/services/habit.service.ts:21:70
     return habit;
   }
 
-  async create(userId: string, data: CreateHabitDto): Promise<Habit> {
-    if (data.categoryId) {
-      const category = await categoryRepository.findById(data.categoryId);
-      if (category === null) {
-        throw new Error('Category not found');
-      }
-    }
-
-    if (data.frequency === 'weekly' && (!data.targetDays || data.targetDays.length === 0)) {
-      throw new Error('Target days are required for weekly habits');
-    }
-
-    if (data.frequency === 'daily' && data.targetDays) {
-      data.targetDays = undefined;
-    }
-
-    return habitRepository.create(userId, data);
-  }
+  async create(userId: string, data: CreateHabitDto): Promise<Habit> {}
 
   async update(id: string, userId: string, data: UpdateHabitDto): Promise<Habit> {
killedBy: Habits E2E Tests Complete Habit Workflow should create a new habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Morning Exercise"
Received: undefined

[Killed] BlockStatement
src/services/habit.service.ts:22:26
   }
 
   async create(userId: string, data: CreateHabitDto): Promise<Habit> {
-    if (data.categoryId) {
-      const category = await categoryRepository.findById(data.categoryId);
-      if (category === null) {
-        throw new Error('Category not found');
-      }
-    }
+    if (data.categoryId) {}
 
     if (data.frequency === 'weekly' && (!data.targetDays || data.targetDays.length === 0)) {
killedBy: HabitService create should throw error if category not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"categoryId": "category-id", "createdAt": 2025-12-01T22:06:53.174Z, "description": "Run 5km", "frequency": "daily", "id": "habit-id", "isActive": true, "targetDays": null, "title": "Morning Run", "updatedAt": 2025-12-01T22:06:53.174Z, "userId": "user-id"}

[Killed] ConditionalExpression
src/services/habit.service.ts:22:9
   }
 
   async create(userId: string, data: CreateHabitDto): Promise<Habit> {
-    if (data.categoryId) {
+    if (false) {
       const category = await categoryRepository.findById(data.categoryId);
       if (category === null) {
killedBy: HabitService create should throw error if category not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"categoryId": "category-id", "createdAt": 2025-12-01T22:06:53.152Z, "description": "Run 5km", "frequency": "daily", "id": "habit-id", "isActive": true, "targetDays": null, "title": "Morning Run", "updatedAt": 2025-12-01T22:06:53.152Z, "userId": "user-id"}

[Killed] ConditionalExpression
src/services/habit.service.ts:24:11
   async create(userId: string, data: CreateHabitDto): Promise<Habit> {
     if (data.categoryId) {
       const category = await categoryRepository.findById(data.categoryId);
-      if (category === null) {
+      if (true) {
         throw new Error('Category not found');
       }
killedBy: HabitService create should create daily habit
statusReason: Error: Category not found

[Killed] BlockStatement
src/services/habit.service.ts:24:30
   async create(userId: string, data: CreateHabitDto): Promise<Habit> {
     if (data.categoryId) {
       const category = await categoryRepository.findById(data.categoryId);
-      if (category === null) {
-        throw new Error('Category not found');
-      }
+      if (category === null) {}
     }
 
killedBy: HabitService create should throw error if category not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/services/habit.service.ts:25:25
     if (data.categoryId) {
       const category = await categoryRepository.findById(data.categoryId);
       if (category === null) {
-        throw new Error('Category not found');
+        throw new Error("");
       }
     }
killedBy: HabitService create should throw error if category not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Category not found"
Received message:   ""

       99 |             } else {
      100 |               stryCov_9fa48("50");
    > 101 |               throw new Error(stryMutAct_9fa48("51") ? "" : (stryCov_9fa48("51"), 'Category not found'));

[Killed] BooleanLiteral
src/services/habit.service.ts:29:41
       }
     }
 
-    if (data.frequency === 'weekly' && (!data.targetDays || data.targetDays.length === 0)) {
+    if (data.frequency === 'weekly' && (data.targetDays || data.targetDays.length === 0)) {
       throw new Error('Target days are required for weekly habits');
     }
killedBy: HabitService create should throw error for weekly habit without target days
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Target days are required for weekly habits"
Received message:   "Cannot read properties of undefined (reading 'length')"

      104 |         }
      105 |       }

[Killed] EqualityOperator
src/services/habit.service.ts:29:9
       }
     }
 
-    if (data.frequency === 'weekly' && (!data.targetDays || data.targetDays.length === 0)) {
+    if (data.frequency !== 'weekly' && (!data.targetDays || data.targetDays.length === 0)) {
       throw new Error('Target days are required for weekly habits');
     }
killedBy: Habits E2E Tests Complete Habit Workflow should create a new habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 401

[Killed] StringLiteral
src/services/habit.service.ts:30:23
     }
 
     if (data.frequency === 'weekly' && (!data.targetDays || data.targetDays.length === 0)) {
-      throw new Error('Target days are required for weekly habits');
+      throw new Error("");
     }
 
killedBy: HabitService create should throw error for weekly habit without target days
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Target days are required for weekly habits"
Received message:   ""

      109 |         } else {
      110 |           stryCov_9fa48("63");
    > 111 |           throw new Error(stryMutAct_9fa48("64") ? "" : (stryCov_9fa48("64"), 'Target days are required for weekly habits'));

[Killed] ConditionalExpression
src/services/habit.service.ts:33:9
       throw new Error('Target days are required for weekly habits');
     }
 
-    if (data.frequency === 'daily' && data.targetDays) {
+    if (true) {
       data.targetDays = undefined;
     }
killedBy: Habits E2E Tests Complete Habit Workflow should create a new habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
src/services/habit.service.ts:33:9
       throw new Error('Target days are required for weekly habits');
     }
 
-    if (data.frequency === 'daily' && data.targetDays) {
+    if (true && data.targetDays) {
       data.targetDays = undefined;
     }
killedBy: Habits E2E Tests Complete Habit Workflow should create a new habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
src/services/habit.service.ts:40:82
     return habitRepository.create(userId, data);
   }
 
-  async update(id: string, userId: string, data: UpdateHabitDto): Promise<Habit> {
-    await this.getById(id, userId);
-
-    if (data.categoryId) {
-      const category = await categoryRepository.findById(data.categoryId);
-      if (category === null) {
-        throw new Error('Category not found');
-      }
-    }
-
-    if (data.frequency === 'weekly' && (!data.targetDays || data.targetDays.length === 0)) {
-      throw new Error('Target days are required for weekly habits');
-    }
-
-    if (data.frequency === 'daily') {
-      data.targetDays = undefined;
-    }
-
-    const updated = await habitRepository.update(id, data);
-    if (updated === null) {
-      throw new Error('Failed to update habit');
-    }
-    return updated;
-  }
+  async update(id: string, userId: string, data: UpdateHabitDto): Promise<Habit> {}
 
   async delete(id: string, userId: string): Promise<void> {
killedBy: Habits E2E Tests Complete Habit Workflow should update habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/services/habit.service.ts:43:9
   async update(id: string, userId: string, data: UpdateHabitDto): Promise<Habit> {
     await this.getById(id, userId);
 
-    if (data.categoryId) {
+    if (false) {
       const category = await categoryRepository.findById(data.categoryId);
       if (category === null) {
killedBy: Habits E2E Tests Complete Habit Workflow should update habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/services/habit.service.ts:43:9
   async update(id: string, userId: string, data: UpdateHabitDto): Promise<Habit> {
     await this.getById(id, userId);
 
-    if (data.categoryId) {
+    if (true) {
       const category = await categoryRepository.findById(data.categoryId);
       if (category === null) {
killedBy: Habits E2E Tests Complete Habit Workflow should update habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[NoCoverage] ConditionalExpression
src/services/habit.service.ts:45:11
 
     if (data.categoryId) {
       const category = await categoryRepository.findById(data.categoryId);
-      if (category === null) {
+      if (false) {
         throw new Error('Category not found');
       }

[Killed] LogicalOperator
src/services/habit.service.ts:50:9
       }
     }
 
-    if (data.frequency === 'weekly' && (!data.targetDays || data.targetDays.length === 0)) {
+    if (data.frequency === 'weekly' || !data.targetDays || data.targetDays.length === 0) {
       throw new Error('Target days are required for weekly habits');
     }
killedBy: Habits E2E Tests Complete Habit Workflow should update habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/services/habit.service.ts:50:9
       }
     }
 
-    if (data.frequency === 'weekly' && (!data.targetDays || data.targetDays.length === 0)) {
+    if (true && (!data.targetDays || data.targetDays.length === 0)) {
       throw new Error('Target days are required for weekly habits');
     }
killedBy: Habits E2E Tests Complete Habit Workflow should update habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/services/habit.service.ts:54:9
       throw new Error('Target days are required for weekly habits');
     }
 
-    if (data.frequency === 'daily') {
+    if (false) {
       data.targetDays = undefined;
     }
killedBy: Habits E2E Tests Complete Habit Workflow should update habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/services/habit.service.ts:54:9
       throw new Error('Target days are required for weekly habits');
     }
 
-    if (data.frequency === 'daily') {
+    if (true) {
       data.targetDays = undefined;
     }
killedBy: Habits E2E Tests Complete Habit Workflow should update habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/services/habit.service.ts:59:9
     }
 
     const updated = await habitRepository.update(id, data);
-    if (updated === null) {
+    if (false) {
       throw new Error('Failed to update habit');
     }
killedBy: Habits E2E Tests Complete Habit Workflow should update habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] EqualityOperator
src/services/habit.service.ts:59:9
     }
 
     const updated = await habitRepository.update(id, data);
-    if (updated === null) {
+    if (updated !== null) {
       throw new Error('Failed to update habit');
     }
killedBy: Habits E2E Tests Complete Habit Workflow should update habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BlockStatement
src/services/habit.service.ts:65:59
     return updated;
   }
 
-  async delete(id: string, userId: string): Promise<void> {
-    await this.getById(id, userId);
-    const deleted = await habitRepository.delete(id);
-    if (!deleted) {
-      throw new Error('Failed to delete habit');
-    }
-  }
+  async delete(id: string, userId: string): Promise<void> {}
 }
 
killedBy: Habits E2E Tests Complete Habit Workflow should delete habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 401

[Killed] ConditionalExpression
src/services/habit.service.ts:68:9
   async delete(id: string, userId: string): Promise<void> {
     await this.getById(id, userId);
     const deleted = await habitRepository.delete(id);
-    if (!deleted) {
+    if (false) {
       throw new Error('Failed to delete habit');
     }
killedBy: Habits E2E Tests Complete Habit Workflow should delete habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 401

[Killed] ConditionalExpression
src/services/habit.service.ts:68:9
   async delete(id: string, userId: string): Promise<void> {
     await this.getById(id, userId);
     const deleted = await habitRepository.delete(id);
-    if (!deleted) {
+    if (true) {
       throw new Error('Failed to delete habit');
     }
killedBy: Habits E2E Tests Complete Habit Workflow should delete habit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 400

[NoCoverage] StringLiteral
src/services/habit.service.ts:69:23
     await this.getById(id, userId);
     const deleted = await habitRepository.delete(id);
     if (!deleted) {
-      throw new Error('Failed to delete habit');
+      throw new Error("");
     }
   }
