[Killed] BlockStatement
src/services/log.service.ts:6:76
 import { CreateHabitLogDto, UpdateHabitLogDto, HabitLog } from '../models/habit-log.model';
 
 class LogService {
-  async getByHabitId(habitId: string, userId: string): Promise<HabitLog[]> {
-    const habit = await habitRepository.findById(habitId);
-    if (habit === null) {
-      throw new Error('Habit not found');
-    }
-    if (habit.userId !== userId) {
-      throw new Error('Access denied');
-    }
-    return habitLogRepository.findByHabitId(habitId);
-  }
+  async getByHabitId(habitId: string, userId: string): Promise<HabitLog[]> {}
 
   async create(data: CreateHabitLogDto, userId: string): Promise<HabitLog> {
killedBy: LogService getByHabitId should return logs for habit
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ConditionalExpression
src/services/log.service.ts:8:9
 class LogService {
   async getByHabitId(habitId: string, userId: string): Promise<HabitLog[]> {
     const habit = await habitRepository.findById(habitId);
-    if (habit === null) {
+    if (false) {
       throw new Error('Habit not found');
     }
killedBy: LogService getByHabitId should throw error if habit not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Habit not found"
Received message:   "Cannot read properties of null (reading 'userId')"

      64 |         }
      65 |       }
    > 66 |       if (stryMutAct_9fa48("118") ? habit.userId === userId : stryMutAct_9fa48("117") ? false : stryMutAct_9fa48("116") ? true : (stryCov_9fa48("116", "117", "118"), habit.userId !== user

[Killed] BlockStatement
src/services/log.service.ts:8:25
 class LogService {
   async getByHabitId(habitId: string, userId: string): Promise<HabitLog[]> {
     const habit = await habitRepository.findById(habitId);
-    if (habit === null) {
-      throw new Error('Habit not found');
-    }
+    if (habit === null) {}
     if (habit.userId !== userId) {
       throw new Error('Access denied');
killedBy: LogService getByHabitId should throw error if habit not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Habit not found"
Received message:   "Cannot read properties of null (reading 'userId')"

      64 |         }
      65 |       }
    > 66 |       if (stryMutAct_9fa48("118") ? habit.userId === userId : stryMutAct_9fa48("117") ? false : stryMutAct_9fa48("116") ? true : (stryCov_9fa48("116", "117", "118"), habit.userId !== user

[Killed] ConditionalExpression
src/services/log.service.ts:11:9
     if (habit === null) {
       throw new Error('Habit not found');
     }
-    if (habit.userId !== userId) {
+    if (true) {
       throw new Error('Access denied');
     }
killedBy: LogService getByHabitId should return logs for habit
statusReason: Error: Access denied

[Killed] BlockStatement
src/services/log.service.ts:17:76
     return habitLogRepository.findByHabitId(habitId);
   }
 
-  async create(data: CreateHabitLogDto, userId: string): Promise<HabitLog> {
-    const habit = await habitRepository.findById(data.habitId);
-    if (habit === null) {
-      throw new Error('Habit not found');
-    }
-    if (habit.userId !== userId) {
-      throw new Error('Access denied');
-    }
-
-    const existing = await habitLogRepository.findByHabitAndDate(data.habitId, data.date);
-    if (existing !== null) {
-      const updated = await habitLogRepository.update(existing.id, {
-        completed: data.completed,
-        note: data.note,
-      });
-      if (updated === null) {
-        throw new Error('Failed to update log');
-      }
-      return updated;
-    }
-
-    return habitLogRepository.create(data);
-  }
+  async create(data: CreateHabitLogDto, userId: string): Promise<HabitLog> {}
 
   async update(id: string, userId: string, data: UpdateHabitLogDto): Promise<HabitLog> {
killedBy: LogService create should create new log
statusReason: TypeError: Cannot read properties of undefined (reading 'habitId')

[Killed] ConditionalExpression
src/services/log.service.ts:19:9
 
   async create(data: CreateHabitLogDto, userId: string): Promise<HabitLog> {
     const habit = await habitRepository.findById(data.habitId);
-    if (habit === null) {
+    if (true) {
       throw new Error('Habit not found');
     }
killedBy: LogService create should create new log
statusReason: Error: Habit not found

[Killed] ConditionalExpression
src/services/log.service.ts:19:9
 
   async create(data: CreateHabitLogDto, userId: string): Promise<HabitLog> {
     const habit = await habitRepository.findById(data.habitId);
-    if (habit === null) {
+    if (false) {
       throw new Error('Habit not found');
     }
killedBy: LogService create should throw error if habit not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Habit not found"
Received message:   "Cannot read properties of null (reading 'userId')"

      89 |         }
      90 |       }
    > 91 |       if (stryMutAct_9fa48("129") ? habit.userId === userId : stryMutAct_9fa48("128") ? false : stryMutAct_9fa48("127") ? true : (stryCov_9fa48("127", "128", "129"), habit.userId !== user

[Killed] EqualityOperator
src/services/log.service.ts:27:9
     }
 
     const existing = await habitLogRepository.findByHabitAndDate(data.habitId, data.date);
-    if (existing !== null) {
+    if (existing === null) {
       const updated = await habitLogRepository.update(existing.id, {
         completed: data.completed,
killedBy: LogService create should create new log
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
src/services/log.service.ts:27:9
     }
 
     const existing = await habitLogRepository.findByHabitAndDate(data.habitId, data.date);
-    if (existing !== null) {
+    if (false) {
       const updated = await habitLogRepository.update(existing.id, {
         completed: data.completed,
killedBy: LogService create should update existing log if already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
src/services/log.service.ts:28:68
 
     const existing = await habitLogRepository.findByHabitAndDate(data.habitId, data.date);
     if (existing !== null) {
-      const updated = await habitLogRepository.update(existing.id, {
-        completed: data.completed,
-        note: data.note,
-      });
+      const updated = await habitLogRepository.update(existing.id, {});
       if (updated === null) {
         throw new Error('Failed to update log');

[Killed] ConditionalExpression
src/services/log.service.ts:32:11
         completed: data.completed,
         note: data.note,
       });
-      if (updated === null) {
+      if (true) {
         throw new Error('Failed to update log');
       }
killedBy: LogService create should update existing log if already exists
statusReason: Error: Failed to update log

[Killed] EqualityOperator
src/services/log.service.ts:32:11
         completed: data.completed,
         note: data.note,
       });
-      if (updated === null) {
+      if (updated !== null) {
         throw new Error('Failed to update log');
       }
killedBy: LogService create should update existing log if already exists
statusReason: Error: Failed to update log

[NoCoverage] StringLiteral
src/services/log.service.ts:33:25
         note: data.note,
       });
       if (updated === null) {
-        throw new Error('Failed to update log');
+        throw new Error("");
       }
       return updated;

[NoCoverage] BlockStatement
src/services/log.service.ts:41:88
     return habitLogRepository.create(data);
   }
 
-  async update(id: string, userId: string, data: UpdateHabitLogDto): Promise<HabitLog> {
-    const log = await habitLogRepository.findById(id);
-    if (log === null) {
-      throw new Error('Log not found');
-    }
-
-    const habit = await habitRepository.findById(log.habitId);
-    if (habit === null || habit.userId !== userId) {
-      throw new Error('Access denied');
-    }
-
-    const updated = await habitLogRepository.update(id, data);
-    if (updated === null) {
-      throw new Error('Failed to update log');
-    }
-    return updated;
-  }
+  async update(id: string, userId: string, data: UpdateHabitLogDto): Promise<HabitLog> {}
 
   async delete(id: string, userId: string): Promise<void> {

[NoCoverage] EqualityOperator
src/services/log.service.ts:43:9
 
   async update(id: string, userId: string, data: UpdateHabitLogDto): Promise<HabitLog> {
     const log = await habitLogRepository.findById(id);
-    if (log === null) {
+    if (log !== null) {
       throw new Error('Log not found');
     }

[NoCoverage] BlockStatement
src/services/log.service.ts:43:23
 
   async update(id: string, userId: string, data: UpdateHabitLogDto): Promise<HabitLog> {
     const log = await habitLogRepository.findById(id);
-    if (log === null) {
-      throw new Error('Log not found');
-    }
+    if (log === null) {}
 
     const habit = await habitRepository.findById(log.habitId);

[NoCoverage] EqualityOperator
src/services/log.service.ts:48:27
     }
 
     const habit = await habitRepository.findById(log.habitId);
-    if (habit === null || habit.userId !== userId) {
+    if (habit === null || habit.userId === userId) {
       throw new Error('Access denied');
     }

[NoCoverage] LogicalOperator
src/services/log.service.ts:48:9
     }
 
     const habit = await habitRepository.findById(log.habitId);
-    if (habit === null || habit.userId !== userId) {
+    if (habit === null && habit.userId !== userId) {
       throw new Error('Access denied');
     }

[NoCoverage] ConditionalExpression
src/services/log.service.ts:53:9
     }
 
     const updated = await habitLogRepository.update(id, data);
-    if (updated === null) {
+    if (false) {
       throw new Error('Failed to update log');
     }

[NoCoverage] ConditionalExpression
src/services/log.service.ts:53:9
     }
 
     const updated = await habitLogRepository.update(id, data);
-    if (updated === null) {
+    if (true) {
       throw new Error('Failed to update log');
     }

[Killed] BlockStatement
src/services/log.service.ts:59:59
     return updated;
   }
 
-  async delete(id: string, userId: string): Promise<void> {
-    const log = await habitLogRepository.findById(id);
-    if (log === null) {
-      throw new Error('Log not found');
-    }
-
-    const habit = await habitRepository.findById(log.habitId);
-    if (habit === null || habit.userId !== userId) {
-      throw new Error('Access denied');
-    }
-
-    const deleted = await habitLogRepository.delete(id);
-    if (!deleted) {
-      throw new Error('Failed to delete log');
-    }
-  }
+  async delete(id: string, userId: string): Promise<void> {}
 }
 
killedBy: LogService delete should delete log successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "log-id"

Number of calls: 0

[Killed] EqualityOperator
src/services/log.service.ts:66:9
     }
 
     const habit = await habitRepository.findById(log.habitId);
-    if (habit === null || habit.userId !== userId) {
+    if (habit !== null || habit.userId !== userId) {
       throw new Error('Access denied');
     }
killedBy: LogService delete should delete log successfully
statusReason: Error: Access denied

[Killed] ConditionalExpression
src/services/log.service.ts:71:9
     }
 
     const deleted = await habitLogRepository.delete(id);
-    if (!deleted) {
+    if (true) {
       throw new Error('Failed to delete log');
     }
killedBy: LogService delete should delete log successfully
statusReason: Error: Failed to delete log

[Killed] BooleanLiteral
src/services/log.service.ts:71:9
     }
 
     const deleted = await habitLogRepository.delete(id);
-    if (!deleted) {
+    if (deleted) {
       throw new Error('Failed to delete log');
     }
killedBy: LogService delete should delete log successfully
statusReason: Error: Failed to delete log
