[Killed] BlockStatement
src/services/category.service.ts:5:39
 import { Category } from '../models/category.model';
 
 class CategoryService {
-  async getAll(): Promise<Category[]> {
-    await categoryRepository.seed();
-    return categoryRepository.findAll();
-  }
+  async getAll(): Promise<Category[]> {}
 
   async getById(id: string): Promise<Category> {
killedBy: Habits E2E Tests Complete Habit Workflow should get all user habits
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/services/category.service.ts:10:48
     return categoryRepository.findAll();
   }
 
-  async getById(id: string): Promise<Category> {
-    const category = await categoryRepository.findById(id);
-    if (category === null) {
-      throw new Error('Category not found');
-    }
-    return category;
-  }
+  async getById(id: string): Promise<Category> {}
 }
 
killedBy: CategoryService getById should return category by id
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
src/services/category.service.ts:12:9
 
   async getById(id: string): Promise<Category> {
     const category = await categoryRepository.findById(id);
-    if (category === null) {
+    if (false) {
       throw new Error('Category not found');
     }
killedBy: CategoryService getById should throw error if category not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] ConditionalExpression
src/services/category.service.ts:12:9
 
   async getById(id: string): Promise<Category> {
     const category = await categoryRepository.findById(id);
-    if (category === null) {
+    if (true) {
       throw new Error('Category not found');
     }
killedBy: CategoryService getById should return category by id
statusReason: Error: Category not found
